{
   "type": "dir",
   "name": "~",
   "contents": [
      {
         "type": "text",
         "name": "welcome",
         "contents": "Welcome to my website. You can use this terminal to learn more about me and my current projects. If you don't have any experience using a computer terminal, simply type 'help' to learn how to navigate through mine."
      },
      {
         "type": "text",
         "name": "about",
         "contents": "My name is Sebastian.<br><br>I'm currently working at the<br>Office of Engineering Computing.<br><br>I'm a 4th Year Computer Science Major at the<br>University of California, San Diego.<br>"
      },
      {
         "type": "dir",
         "name": "experience",
         "contents": [
            {
               "type": "exec",
               "name": "oec",
               "contents": "http://support.eng.ucsd.edu/",
               "description": "Office of Engineering Computing"
            },
            {
               "type": "exec",
               "name": "cse",
               "contents": "http://cse.ucsd.edu",
               "description": "Computer Science and Engineering Department"
            }
         ]
      },
      {
         "type": "dir",
         "name": "projects",
         "contents": [
            {
               "type": "exec",
               "name": "DontStarve",
               "contents": "https://github.com/SebastianDang/DontStarve",
               "description": "Don't Starve is a simple Android Application built for a software engineering class (CSE110). Although the application is far from complete, it taught me a lot about agile development and working with customers whose demands can range from superficial to realistic."
            },
            {
               "type": "exec",
               "name": "OpenGL",
               "contents": "https://github.com/SebastianDang/OpenGL_Concepts",
               "description": "After taking a Computer Graphics course, I wanted to dive more into the OpenGL concepts I learned towards the end of the class. This application replicates water using Frame Buffer Objects for both reflection and refraction, clipping planes, and DU/DV maps to create a wavy effect. Currently, I'm working on making this more realistic to mimic the basic properties of water."
            },
            {
               "type": "exec",
               "name": "ComputerGraphics",
               "contents": "https://github.com/SebastianDang/CSE167_Final",
               "description": "The Island is a final project for CSE167: Computer Graphics, using openGL and C++. This project attempts to summarize concepts learned in the course throughout the quarter and implement advanced computer graphics concepts. Some concepts were cut to meet deadlines, so some parts of the final project were not fully implemented as planned."
            },
            {
               "type": "exec",
               "name": "Charm",
               "contents": "https://github.com/SebastianDang/Charmhttps://github.com/SebastianDang/Charm",
               "description": "Charm is a simple framework for an android application. Initially created for a future android application that would be a social network app. However, the project was temporarily shelved, but has simple server sided authentication for user registration and login."
            },
            {
               "type": "exec",
               "name": "More",
               "contents": "https://github.com/SebastianDang/",
               "description": "More to come on my Github."
            }
         ]
      }
   ]
}
